#include "pch.h"

void Comment1()
{
	// 리소스매니저
	// 만드는 중

	// 리소스 매니저란
	// 게임할 때 외부파일, (어떤 애플이든 외부파일은 필요하다) (오디오, 3D모델링, 텍스처, 애니메이션 파일)
	// 매니저(관리하는 객체)

	// 주요 기능 : [리소스 로드Load] [리소스 가져오기 Get] 

	// 프레임워크에서 매니저
	// => 기본적으로 보통 엔진에서 지원을 해줌

	// 우리는 Windows API를 활용해 게임을 만들고 있으므로
	// Windows에서 밖에 안돌아감
	
	// Mac, IOS, Android 등
	// OS마다 리소스를 로딩하는 방식이 다 다름
	// Windows API에서 제공해주는 이미지 로딩

	// Android(JAVA)
	// Android API에서 제공해주는 이미지로딩.

	// IOS (Swift, Object C)
	// Swift, Object C 에서 제공해주는 이미지로딩 API를 활용해서

	// Load함수에서 
	// 처음보는 함수들 되게 많이 나올거다
	// 근데 외울 필요 1도 없다.
	// 선생님도 모름(면접관도 인터넷 없으면 모른다)

	// 근데 면접관도 모르는걸 왜배우냐? => 이 접근은 안된다.
	// 지금은 엔진의 기능을 직접 구현해본다. 라는 취지로 접근해라

	// 이 리소스매니저의 코드는 100% 이해할 필요가 ㅇ벗다.
	// 내부적으로 어떻게 
}