#include "pch.h"

void Comment()
{
	// 두더지 잡기 만들기
}

void Comment2()
{
	// 두더지 잡기
	// 1. 어떤 클래스를 만들것인지 미리 구조짜기
	//	- 미리 해둬야 나중에 코드짜다가 크게 엇나가지 않음
	//		-> 코드를 말로 바꾸는 힘

	// 클래스 목록
	// 1. 씬클래스 (MoleGameScene)
	//		- 실제 두더지 잡기에서 일어나는 게임 룰에 관한 내용들

	// 2. 두더지 클래스
	//		- 두더지 (나오기, 들어가기, 죽기)

	// 클래스를 나눌수록
	// 협업하기에 좋다.
	// 협업하기에 좋다는 것 == 유지보수에 좋다.

	// 클래스를 나누지 않을수록
	// 혼자 작업하기에 좋다.
	// 혼자 작업하게 좋다는 것 == 생산성이 좋다.
}

void Comment3()
{
	// 이미지가 있는 게임을 만들 때
	// 선생님의 경우엔 이미지 작업을 먼저 하는게 편하다고 한다.

	// Atlas 검색해보기
}