#include "pch.h"

void Comment1()
{
	// 수업내용
	// 1. TileMap 을 만들긴 만들었는데, 리소스가 없었죠?
	//   - Resource 적용.

	// 2. 맵툴 제작
	//   - (툴 제작) 게임 제작에 필수적인 요소
}

void Comment2()
{
	// 실습.

	// 수업자료에 올린 Resources/TileStudy/pocket_0.bmp ~ pocket_12.bmp
	// 를 활용해서
	// 화면에 보이는 포켓몬스터 맵화면 띄우기
	// (플레이어 있는칸은 옆에칸으로 대체)

	//코드적으로 그렇게 어려운건아닌데
	// 하는이유가
	// 앞으로 저희 수업 다 타일맵기준으로

	// 오늘숙제가 포켓몬스터 맵화면 만들기
}

void Comment3()
{
	// 맵툴 제작
	//  - 맵툴이란?


	// Map Tool
	// 직역 : 맵 제작 도구
	//
	// 우리는 게임을 제작하는건데, 맵제작을 왜 하는가?
	// 그래픽 디자이너가 모든맵을 만들어주진 않는다.
	// 타일맵일 경우, 타일들만 그려주지, 맵을 그려주진 않는다.
	// 기획자가 실제로 맵을 제작한다.
	// 기획자가 맵을 제작할 때, 프로그래머가 만들어준 맵 제작 도구(맵툴)을 사용한다.
	// 그걸 위해 프로그래머가 툴을 만들어 주는거다.
	
	// 기획자가 만든(데이터) + 프로그래머가 만든 (게임로직)
	//  => 게임  (모든 게임은 '데이터 - File + 로직' 으로 이루어진다.)

	// 수치조정 밸런스패치
	// - 프로그래머가 작업 X

	// 씬에서 마우스 좌 클릭을하면 해당 타일이 변하도록 (Value + 1)
	// (타일맵의 타일을 클릭하면, 해당 타일이 변경되도록)
	// (맵툴타일맵 액터)
	// 
	// Value가 Max를 넘어가면 0으로 변경

	// 타일 셋을 포켓몬스터 타일셋으로 변경하고 시작해보자
}

void Comment4()
{
	// 맵툴로 만든 맵 데이터를 파일로 저장하기
	// 맵 데이터를 불러오기


}