#include "pch.h"

void Comment1()
{
	// 드디어 본격적인 게임 개발

	// 지금부터 우리가 만들 게임 : 타워 디펜스

	// 게임을 어떻게 만드는가?
	// 
	// ★★★내가 생각하는 이 게임의 핵심 기능부터 만들면 된다.★★★

	// 필요한 기능을 적어놓는 것 (이걸 WBS(기능 + 몇일 걸릴지)라고 한다. ) (혹은 간트 차트)
	// 기능 
	//	- MAP 구현
	//	- 타워 건설 기능
	//	- 몬스터 AI(타워가 공격하려면 필요함)
	//	- 타워 공격 기능
	//	- 몬스터 리젠(WAVE 시스템 기능)
	//  - Life 기능

	// mermaid live editor (일정 설정을 도와주는 웹사이트)
	// 일정 설정을 안해주면 마냥 늘어지니 설정 해주는게 중요!
	// 자기 실력을 잘 파악할수록 일정 설정을 잘 할 수 있다.

	// 처음부터 만드는 수업을 할거라 
	// 중간에 버그가 발생해서 이상한데서 시간이 끌릴 수 있다.

	// 이 수업을 어떻게 보면 좋냐?
	// - 나는 어디서 어떻게 막혔는데
	// - 이런식으로 풀어나가는거구나 
	// 이런식으로 봐주면 된다.

}