namespace _20240614_01
{
    public class Program
    {
        public static void Main(string[] args)
        {
            Console.WriteLine("Hello, World!");
            Console.WriteLine("동해물과 백두산이 마르고달도록 ... ");
        }
    }
}


// 새로운 언어를 배울때 체크해야할 것.
// 나는 C, C++ 를 배워서
// 언리얼엔진을 배워서 회사에서 취업해서
// 언리얼엔진으로 게임만들것이다.


// -> C++만 배우면 끝나는거아니야? 

// 본격적인 게임을 만들게되면 (회사에 취업하거나, 인디게임을 만들거나)
// 엔진작업보다 엔진 외적인 작업을 해야할 경우가 상당히 많아요.

// C++로는 그런툴을만들기에는 많이 어렵습니다.

// 대체로 선택하는게, C#이나 Python 같은 고급언어를 많이 선택해요.
// Javascript 도 선택을하는데, 


// 회사에 취업했는데
// 팀장님이 파이썬으로 뭐 만들어와.
// 나는 C++밖에 안했는데 그걸 어떻게만들지?
// 
// 신규언어 배울때 보통 기간을 회사기준 하루줍니다.
// 
// 신규언어를 배울때 체크해야할것.

// (언어를 하나 확실하게 안다는 가정) 

// 1주일차~ 2주일차때 했던과정들을 상상해보면돼요.

// 1) 변수 선언 + 사칙연산
// 2) if문, for문, while문 
// 3) 함수 콜 (매게변수의 값을 변경하는 방법) 
// 4) vector, map 을 이 언어에는 어떻게 사용하는지?
// 5) 그러면 C++에서 만들었던 숙제들을 지금당장 구현할수있는지?
// 6) 메모리구조. (Heap, Stack, Code, Data) (좀 큰프로젝트를 만들때 꼭 알아둘것.)
// 7) [클래스, 인터페이스] 사용방법만 익히시면됩니다.
//  - 프로그램 아키텍처 


// 1. 사용자정의자료형 (Enum, Class, Struct)
// 2. object 특징


// 딱 저정도만 배우면, 일단 사용가능한 언어라고 생각하시면됩니다.
