/*
뭘 배우던 간에 암기는 항상 존재한다.

프로그래밍은 1년까지는 암기가 더 많다!!!

앞으로 1달간 콘솔 프로젝트를 할 때는 

아래와 같은 구조가 기본이다. 
*/

// Ctrl + space를 활용해서 자동완성 목록을 불러올 수 있다. -> 기억안나는 것들을 알 수 있다
#include<iostream>

using namespace std;

void main()
{
	// 여기 안에서 모든 로직이 실행됩니다.
	printf("Hello World!");

	// 실수 많이하는 목록
	// - 프로그래밍은 괄호를 열면 닫아줘라
	// { --- }
	// [ --- ]
	// ( --- )
	// 물론 따옴표도 항상 쌍을 이뤄야 한다.
	// 대부분의 언어엔 그렇다
	// 명령어 쓰면 뒤에 ;(세미콜론)을 붙여줘야 한다.

	// 중괄호의 의미는
	// 새로운 코드를 쓰겠다.

	{
		// 중괄호를 열면 
		// 탭이 하나 더 추가된다.
	}

	// 줄맞춤이 되게 어려울 수 있다.
	// 줄맞춤 단축키
	// 전체선택(Ctrl + A) 이후  (Ctrl + K)누른 상태로 F를 눌러준다.
	
	// Ctrl + s는 수시로 눌러준다. 
	// 저장이 안된 파일은 실행을 했을 때 수정 이전 마지막 저장된 버전으로 실행이 된다.
}