#include <iostream>

using namespace std;

void main()
{
	// 자료구조 / 알고리즘 설명
	
	// 알고리즘은 그냥 로직
	// 그 중 보편적으로 많이 사용하는 로직
	// (주로 수학적인 개념이 들어있어서 외운다.)
	// 지금은 설명 안한다.


	// 자료구조 
	// 자료구조 이미 배웠고, 사용도 하고 있다. 매우 많이...
	// 지금 벌써 3개나 배웠다.

	// 자료구조란
	// 내가 데이터를 저장하는데, 저장할 수 있는 구조(자료구조)

	// 지금껏 배운 자료구조
	// 1. 정적 배열
	// 2. 동적 배열
	// 3. vector에 저장할 수 있습니다.

	// 자료구조
	// ex) 몬스터 100마리의 체력 데이터
	// int monsterHp[100] = {};
	// int* monsterHp = new int[100]{};
	// vector<int> monsterHps = {};

	// 저장할 수 있는 방법
	// 이거를 각 방법들마다 장점 / 단점이 존재
	// 장점 / 단점에 따라 잘 적용할 수 있어야 한다.

	// 자료구조는 크게 2가지로 나뉜다.
	// 1. 선형구조 
	//		=> 배열, vector
	// 2. 비선형구조
}