#include <iostream>

//프로그램 시작점
void main()
{
	//변수
	//공식
	//프로그래밍은 암기가 많습니다.
	
	//자료형 변수명 = 값;
	//자료형 변수명;

	//자료형
	// => 기억해야하는 내용들의 정보의 형태
	// => 징크스 <<< "문자열" 형태
	// => HP 1000  <<< "숫자" 형태
	// 숫자
	// [정수, 실수]
	// 정수 => 소수점이 없는 형태
	// 실수 => 소수점이 있는 형태

	//프로그래밍에서 가장많이 쓰이는 자료형 : 정수


	//------------------------------------
	// # 두가지형태로 변수를 생성할수있다.
	//------------------------------------
	
	//1. 
	//자료형 변수명 = 값;
	int 변수1 = 50;
	//2. 
	//자료형 변수명;
	int 변수2;

	::printf("내가 생성한 변수의 값 : 100\n");

	//printf에서 변수를 출력하는 방법
	//printf("%d", 출력할 변수명);
	::printf("내가 생성한 변수의 값 : %d \n", 변수1);


	//숙제 아래 29살을 변수로 출력하기.
	::printf("내 나이는 29살 입니다.\n");
}