#include <iostream>

using namespace std;

void main()
{
	// 자료구조 / 알고리즘 설명

	// 알고리즘은 지금 설명안할거에요!
	// 알고리즘은 그냥 로직입니다. 
	// 로직인데 보편적으로 많이 사용하는 로직
	// (주로 수학적인 개념 들어있어서 외웁니다.)


	// 자료구조
	// 자료구조 이미 배웠고, 사용도 하고있어요. 되게 많이..
	// 3개나 배웠습니다.
	
	// 자료구조란
	// 내가 데이터(들)을 저장할건데, 저장할수 있는 구조 (자료구조)
	
	// 1. 정적배열.
	// 2. 동적배열.
	// 3. vector에 저장할 수 있습니다.

	// 자료구조
	// 몬스터 100마리의 체력 데이터
	// int monsterHp[100] = {};
	// int * monterHp = new int[100]{};
	// vector<int> monsterHps = {};

	// 저장할수있는 방법이 되게많아요.
	// 이거를 각 방법들마다 장점 / 단점
	// 장점 / 단점에따라서 잘 적용할수있어야합니다.

	// 자료구조에는 가장 크게 2가지로 나뉘게됩니다.
	// 1. 선형구조
	//		=> 배열, vector 
	// 2. 비선형구조

}