#include "pch.h"

void Summary()
{
	// 1. InputManager
	//  => 키입력 , 마우스입력 등을 관리하는 매니저

	// 2. 충돌체크
	//   게임개발할때 필수인 내용

	// 3. Vector 2D
	//  게임수학에 들어가는 x, y


	// 프레임워크 제작할떄는 
	//--> 모듈, 게임수학을 주로 다루게 됩니다.

	// 모듈을 만들때 최대한 Unity랑 비슷하게 진행하는 이유
	// 왜 Unreal이 아니고 Unity인가??
	 
	// 저번기수때는 Unreal기준으로 했으나
	// 사실 큰 차이가 없다.
	// 근데 선생님 기억이 잘나는게 Unity이기 때문이다.
	// Unreal거를 찾다보면 시간이 매우 많이 걸리기 때문에
	
	// 함수들이 거의 이름만 다르게 불리기 때문에 
	// Unity로 해도 문제가 없다고 생각하신다.

	// 사실 Unity랑 Unreal이랑 핵심기술이 다르면
	// 우리가 Windows API를 배울 필요가 없다.
	
	// 거기에 엔진마다 편의성기능으로 더 들어가있는것
	// 그리고 편의성기능을 추가로 만들줄도 알아야함

	// 그리고 사전조사 때 
	// 저번기수때는 언리얼이 더 많았고
	// 이번기수에는 유니티로 해본사람이 더 많았기 때문


	// C++을 배웠으니 언리얼을 하자 << 이것도 틀리다.
	// 이 수업에서 C#도 배운다.
	// 서버할 때 C#을 할거다.
	// C++을 안다는 가정에서 C#배우는데 1주일 걸린다.
}