#include<iostream>

using namespace std;

void main()
{
	// 1. 문자열 (숫자만 다뤘으니 다른거)
	// 2. 구조체 
	// 3. 포인터 


	// 숙제 
	// 섞은 카드를 5장을 뽑는데
	// 4장은 위에 오픈
	// 1장은 XX로 표현
	
	// ♤A ♤K ♤3 ♤2 XX
	// 플레이어 현재 금액 : 1000
	
	// 1. 베팅 유무 선택
	// 2. 베팅시 - 하이, 로우, 세븐 중에서 선택
	// 3. 하이 선택 시 XX의 값이 7 초과이면 포인트 획득 (베팅한 금액의 2배)
	// 4. 로우 선택 시 XX의 값이 7 미만이면 포인트 획득 (베팅한 금액의 2배)
	// 5. 세븐 선택 시 XX의 값이 7이면 포인트 획든 (베팅한 금액의 11배)
	// 6. 한 판을 하면 전광판이 한장씩 밀린다.
	// ♤K ♤3 ♤2 ♤7 XX
	// 플레이어 현재 금액 : 7300

	// 7. 다음판 진행
	// 8. 52장을 다 쓸 수 있다.
	// 9. 52장을 다쓰거나, 플레이어가 0원이 되면 게임 종료

	// 게임할때마다 카드를 섞는게 아니라
	// 게임시작할때 한 번만 섞는다.
}