//뭘 배우던
//암기는 항상 있습니다.

// 프로그래밍도 사실
// 1년까지는 암기가 더 많아요.

//콘솔 프로젝트를 할때는 (1달)
//그냥 손이 외우듯이 쳐주시면됩니다.
//ctrl + space
#include <iostream>
using namespace std;
void main()
{
	// 여기안에서 모든 로직이 실행됩니다.
	::printf("Hello World!");

	// 실수 많이하는 목록들
	// - 프로그래밍은 기본적으로 괄호를 열면 닫아야합니다.
	// [ ㅁㄴㅇㄻㄴ ]
	// { ㅁㄴㅇㄻㄴ }
	// ( ㅁㄴㅇㄻㄴ )
	// ==> [ { ] } (X) 
	// ==> [ { } ] (X)
	// '', " "  (따옴표 ,쌍따옴표도 항상 쌍을 이루어야합니다.)
	// 대부분의 언어
	// 명령어를 쓰면 뒤에 ; (세미콜론)을 붙여줘야합니다.

	::printf("Hello World!");

	//중괄호의 의미는
	// 새로운 코드를 쓰겠다.
	{
		//중괄호를 열면
		//탭이 하나 더 추가됩니다.
	}

	//줄맞춤이 되게 어려울수 있습니다.
	//줄맞춤 단축키
	// 전체선택 (Ctrl + A) 이후에 (Ctrl + K 누른 상태로 F를 눌러준다)
	::printf("Hello World!");


	//ctrl + s는 수시로 눌러준다.!!
	//저장이 안된파일은 실행을 했을때 그거대로 동작을 안해요 
	//(저장되기 이전버전으로 실행이됩니다.)


}